Revit 2027 API
ElectricalSystem.HotConductorsNumber Property
 The HotConductors Number of the Electrical System.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int HotConductorsNumber { get; }
Public ReadOnly Property HotConductorsNumber As Integer
	Get
public:
property int HotConductorsNumber {
	int get ();
}
member HotConductorsNumber : int with get
Property Value
Int32
Exceptions
Exception | Condition
InvalidOperationException |  This property only available when System Type is Power!
Remarks
 This property is used to retrieve the HotConductors Number of the Electrical System.
See Also
Reference
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace